Frederick005/STM32_Bare_Metal/workspace_stm32f411/3_3_Interrupts_SysTick/Src/main.c
#include "stdio.h"
#include "stm32f4xx.h"
#include "stdint.h"
#include "exti.h"
#include "uart.h"
#include "systick.h"

#define USART2_SR_RXNE   (1U<<5)
char key;

void systick_interrupt_delay (uint32_t delay);
volatile uint32_t delay_counter;

int main()
{
	// Initializing the user led pin
	RCC->AHB1ENR |= (1U<<0);
	GPIOA->MODER = (GPIOA->MODER & ~(3U<<10))|(1U<<10);

	// Initializing UART
	uart_tx_rx_interrupt_init();

	systick_init();


	while (1)
	{
		systick_interrupt_delay (3000);
		GPIOA->ODR ^= (1U<<5);
		printf("Thats one complete systick cycle \n\r");
	}

}

void systick_interrupt_delay (uint32_t delay)
{
	delay_counter = delay;
	while (delay_counter != 0){}
}

void SysTick_Handler (void)
{
	// Prevent unsigned underflow when the counter reaches 0.
	if (delay_counter > 0U)
	{
		delay_counter --;
	}
}

void USART2_IRQHandler(void)
{
	/* 1. The USART ISR is a single funnel shared by all events (RX, TX, Errors).
	 * 2. We must check the Status Register (SR) to verify exactly *why* it fired.
	 * 3. Without this, future TX or Error interrupts would falsely trigger this RX logic.
	 * 4. (Note: Reading the Data Register (DR) automatically clears the RXNE flag). */

	if (USART2->SR & USART2_SR_RXNE)
	{

		key = (char)USART2->DR;

		if (key=='1')
		{
			printf("USART2 Interrupt Generated\n\r");
			GPIOA->ODR |= (1U<<5);
		}
		else
		{
			GPIOA->ODR &= ~(1U<<5);
		}
	}
}

